# задача 1
# i = int(input('Введите первое число трехзначного числа: '))
# j = int(input('Введите второе число трехзначного числа: '))  # Очень ленивое решение
# k = int(input('Введите третье число трехзначного числа: '))
# sum = (i + j + k)
# print(sum)

# n = int(input("Введите трехзначное число: "))  # Не ленивое решение

# d1 = n % 10
# d2 = n % 100 // 10
# d3 = n // 100
# print("Сумма цифр числа: ", d1 + d2 + d3)

# задача 2
# s = int(input('Сколько всего журавликов: '))
# p = s // 3 // 2
# c = p
# k = (p + c) * 2
# x = p + c + k
# if x == s:
#     print("Петя сделал: ",p,"\nСерёжа сделал: ",c,"\nКатя сделала: ",k,)
# else:
#     y = s % x
#     print("Петя сделал: ",p,"\nСерёжа сделал: ",c,"\nКатя сделала: ",k,"\nОтпочковался:",y,)

# задача 3

# задача 4